Autodesk.Revit.DB.ImageTypeLoadedStatus
Indicates the current state of the contents of the ImageType.
Since:
2020
Since:
2020

Autodesk.Revit.DB.ImageTypeLoadedStatus.Loaded
The contents of ImageType was loaded.

Autodesk.Revit.DB.ImageTypeLoadedStatus.NotLoaded
No attempt to load the ImageType has been made.  No image is available.